# 字面量和字面量的拼接
print("我是：" + "小明")
# 字面量和变量的拼接
name = "小明"
address = "中国广东广州"
tel = 10086
print("我是：" + name + ",我的地址是：" + address + ",我的电话是：" + str(tel))  # +号是不能接int类型的

# 占位符%
# 1、占位符%s - 将内容转换为字符串，放入站位位置
print("1、我是：%s,我的地址是：%s,我的电话是：%s" % (name, address, tel))
# 2、占位符%d - 将内容转换为整数，放入站位位置
print("2、我是：%s,我的地址是：%s,我的电话是：%d" % (name, address, tel))
# 3、占位符%f - 将内容转换为浮点型，放入站位位置
print("3、我是：%s,我的地址是：%s,我的电话是：%f" % (name, address, tel))

# 占位符精度控制 m.n（m:宽度，包含小数点和小数，空格补全；n:小数保留位数，四舍五入）
num1 = 11
num2 = 11.345
print("数字11宽度限制5，结果是：%5d" % num1)
print("数字11宽度限制1，结果是：%1d" % num1)  # 宽度比实际小，不生效
print("数字11.345宽度限制7，小数精度2，结果是：%7.2f" % num2)
print("数字11.345不限制，小数精度2，结果是：%.2f" % num2)

# 占位符f"{占位}"  不改数据类型，不做精度控制
name = "小明"
age = 18
price = 19.99
# f:format
print(f"我是{name}，年纪：{age}岁，身价：{price}")

# 拓展 - 表达式占位
print("1 * 1的结果是：%d" % (1 * 1))
print(f"1 * 2的结果是：{1 * 2}")
print("字符串在Python中的类型是：%s" % type("字符串"))
